# @Author: Benanahai
# @Time  : 2025/4/27 14:05 
# @Desc  :

"""
结合场景详细介绍两种常用的索引方式：

- 第一种是基于位置（整数）的索引，案例短平快，有个粗略的了解即可，实际中偶有用到，但它的应用范围不如第二种广泛。
- 第二种是基于名称（标签）的索引，这是要敲黑板练的重点，因为它将是我们后面进行数据清洗和分析的重要基石。
"""
import pandas as pd

df1 = pd.DataFrame({
    '流量来源': ['一级','一级','一级','一级','一级','一级','一级','一级','一级','一级','一级','一级','二级','二级','二级','三级','三级','四级','四级'],
    '来源明细':['-A','-B','-C','-D','-E','-F','-G','-H','-I','-J','-K','-L','-A','-B','-C','-A','-B','-C','-D'],
    '访客数':[48849,4899,153,128979,11,10,9,8,7,6,5,4,3,2,1,1,1,1,1,1]})